FETCH THE DATA FROM STUDENT DATABASE

In [18]:
#FETCH THE DATA FROM STUDENT DATABASE
import sqlite3

In [19]:
#First connection object
db=sqlite3.connect("student_database.db")

In [20]:
#create cursor object from connection
cur=db.cursor()

In [21]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)

In [22]:
cur.execute("insert into student(id,name,marks)values(9,'Andrew',70)")
db.commit()

In [23]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)

In [24]:
cur.execute("insert into student values(10,'Andrew',70)")
db.commit()

In [25]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [26]:
results=cur.execute("select * from student where id=1")
for row in results:
    print(row)

(1, 'John', 90)

In [27]:
results=cur.execute("select * from student where id=2")
for row in results:
    print(row)

(2, 'Teena', 100)

In [28]:
results=cur.execute("select * from student where id=3")
for row in results:
    print(row)

(3, 'Andrew', 70)

In [29]:
results=cur.execute("select * from student where id=4")
for row in results:
    print(row)

(4, 'Dorsey', 56)

In [30]:
results=cur.execute("select * from student where id=5")
for row in results:
    print(row)

(5, 'David', 45)

In [31]:
results=cur.execute("select * from student where id=6")
for row in results:
    print(row)

(6, 'Kim', 70)

In [32]:
results=cur.execute("Select * from student limit 3")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)

In [33]:
results=cur.execute("Select name from student where id=2")
for i in results:
    print(i)

('Teena',)

In [34]:
results=cur.execute("Select marks from student where id=2")
for i in results:
    print(i)

(100,)

In [35]:
results=cur.execute("Select * from student where name='John'")
for i in results:
    print(i)

(1, 'John', 90)

In [36]:
results=cur.execute("Select marks from student where name='John'")
for i in results:
    print(i)

(90,)

In [37]:
results=cur.execute("Select * from student where marks>60 and marks<90")
for i in results:
    print(i)

(3, 'Andrew', 70)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [38]:
results=cur.execute("Select * from student where marks>40 and marks<60")
for i in results:
    print(i)

(4, 'Dorsey', 56)
(5, 'David', 45)

In [39]:
results=cur.execute("Select*from student")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [40]:
#fetchall will display all rows
results=cur.execute('Select * from student')
results.fetchall()

[(1, 'John', 90),
 (2, 'Teena', 100),
 (3, 'Andrew', 70),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (6, 'Kim', 70),
 (7, 'Kiara', 75),
 (8, 'Jack', 94),
 (9, 'Andrew', 70),
 (10, 'Andrew', 70)]

In [41]:
#Order (ascending or descending) by clause
results=cur.execute("Select * from student order by name asc")
for i in results:
    print(i)

(3, 'Andrew', 70)
(9, 'Andrew', 70)
(10, 'Andrew', 70)
(5, 'David', 45)
(4, 'Dorsey', 56)
(8, 'Jack', 94)
(1, 'John', 90)
(7, 'Kiara', 75)
(6, 'Kim', 70)
(2, 'Teena', 100)

In [42]:
results=cur.execute("Select*from student order by name desc")
results.fetchall()

[(2, 'Teena', 100),
 (6, 'Kim', 70),
 (7, 'Kiara', 75),
 (1, 'John', 90),
 (8, 'Jack', 94),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (3, 'Andrew', 70),
 (9, 'Andrew', 70),
 (10, 'Andrew', 70)]

In [43]:
#AND operator
results=cur.execute("Select * from student where name='David' and marks=45")
for i in results:
    print(i)

(5, 'David', 45)

In [44]:
results=cur.execute("Select * from student where name='David' and marks=68")
for i in results:
    print(i)

In [45]:
results=cur.execute("Select * from student where id=2 and marks=70")
for i in results:
    print(i)

In [46]:
#OR operator
results=cur.execute("Select * from student where id=2 or marks=70")
for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(6, 'Kim', 70)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [47]:
results=cur.execute("Select * from student where id=3 or marks=100")
results.fetchall()

[(2, 'Teena', 100), (3, 'Andrew', 70)]

In [48]:
results=cur.execute("Select * from student where id=2 or marks=70")
for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(6, 'Kim', 70)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [49]:
#Aggregate Functions
#MIN – find minimum
#MAX – find maximum
#AVG – find average
#SUM – find sum
#COUNT – count the number of rows

In [50]:
#find minimum marks
results=cur.execute("Select min(marks) from student")
for i in results:
    print(i)

(45,)

In [51]:
#find maximum marks
results=cur.execute("Select max(marks) from student")
results.fetchone()

(100,)

In [52]:
#find average marks
results=cur.execute("Select avg(marks) from student")
results.fetchone()

(74.0,)

In [53]:
results=cur.execute("Select avg(marks) from student")
for i in results:
    print(i)

(74.0,)

In [54]:
#find sum
results=cur.execute("Select sum(marks) from student")
results.fetchone()

(740,)

In [55]:
results=cur.execute("Select count(marks) from student")
results.fetchone()

(10,)

In [56]:
#(fetchall for more than 1 row, fechone for more than 1 row)

In [57]:
results=cur.execute("Select * from student where marks between 65 and 85")
for i in results:
    print(i)

(3, 'Andrew', 70)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [58]:
results=cur.execute("Select * from student where marks between 65 and 85")
results.fetchall()

[(3, 'Andrew', 70),
 (6, 'Kim', 70),
 (7, 'Kiara', 75),
 (9, 'Andrew', 70),
 (10, 'Andrew', 70)]

In [59]:
results=cur.execute("Select * from student where marks is null")
for i in results:
    print(i)

In [60]:
results=cur.execute("Select * from student where marks is not null")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [61]:
#LIKE operators

In [62]:
results=cur.execute("Select * from student where name like 'D%'")#start with D name
for i in results:
    print(i)

(4, 'Dorsey', 56)
(5, 'David', 45)

In [63]:
results=cur.execute("Select * from student where name like 'J%'")#start with J name
for i in results:
    print(i)

(1, 'John', 90)
(8, 'Jack', 94)

In [64]:
results=cur.execute("Select * from student where name like '_a%'")#after one character a in name
for i in results:
    print(i)

(5, 'David', 45)
(8, 'Jack', 94)

In [65]:
results=cur.execute("Select * from student where name like '%m'")#last character m in name
for i in results:
    print(i)

(6, 'Kim', 70)

In [66]:
results=cur.execute("Select * from student where name like '%e%'")#between character e in name
for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [67]:
results=cur.execute("select * from student")#for all names or data
results.fetchall()

[(1, 'John', 90),
 (2, 'Teena', 100),
 (3, 'Andrew', 70),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (6, 'Kim', 70),
 (7, 'Kiara', 75),
 (8, 'Jack', 94),
 (9, 'Andrew', 70),
 (10, 'Andrew', 70)]

In [68]:
#display only 4 letter character
results=cur.execute("select * from student where name like '___'")#for number of character if type ___ 3 times underscore then 3 characters name if type __ 2 times underscore then 2 character name
for i in results:
    print(i)

(6, 'Kim', 70)

In [69]:
results=cur.execute("select * from student where marks NOT in (70)")
results.fetchall()

[(1, 'John', 90),
 (2, 'Teena', 100),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (7, 'Kiara', 75),
 (8, 'Jack', 94)]

In [70]:
results=cur.execute("select * from student where name NOT in ('Kim')")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

Update Record

In [71]:
#UPDATE record
#update the record
sql="update student set marks=81 where id=4"
cur.execute(sql)
db.commit()

In [72]:
results=cur.execute("select * from student where id=4")
for row in results:
    print(row)

(4, 'Dorsey', 81)

In [73]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 81)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

multiple record update

In [74]:
#multiple record update
sql="update student set marks=92 where id in (1,2)"
cur.execute(sql)
db.commit()

In [75]:
results=cur.execute("select * from student where id in (1,2)")
results.fetchall()

[(1, 'John', 92), (2, 'Teena', 92)]

In [76]:
results=cur.execute("select * from student") 
for row in results:
    print(row)

(1, 'John', 92)
(2, 'Teena', 92)
(3, 'Andrew', 70)
(4, 'Dorsey', 81)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

In [77]:
#multiple records update using ‘IN’
sql="update student SET marks = 68 WHERE id IN (5,6)"
cur.execute(sql)
db.commit()

In [78]:
#verify if its updated
results=cur.execute("SELECT * FROM student")
for i in results:
    print(i)

(1, 'John', 92)
(2, 'Teena', 92)
(3, 'Andrew', 70)
(4, 'Dorsey', 81)
(5, 'David', 68)
(6, 'Kim', 68)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Andrew', 70)
(10, 'Andrew', 70)

Delete any unwanted records

In [79]:
#Delete any unwanted records
sql="delete from student where id=6"
cur.execute(sql)

In [80]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'John', 92),
 (2, 'Teena', 92),
 (3, 'Andrew', 70),
 (4, 'Dorsey', 81),
 (5, 'David', 68),
 (7, 'Kiara', 75),
 (8, 'Jack', 94),
 (9, 'Andrew', 70),
 (10, 'Andrew', 70)]

In [81]:
sql="delete from student where id=4"
cur.execute(sql)
results=cur.execute('select * from student')
results.fetchall()

[(1, 'John', 92),
 (2, 'Teena', 92),
 (3, 'Andrew', 70),
 (5, 'David', 68),
 (7, 'Kiara', 75),
 (8, 'Jack', 94),
 (9, 'Andrew', 70),
 (10, 'Andrew', 70)]

DROP table student

In [82]:
#DROP table student
sql='drop table student'
results=cur.execute(sql)
results=cur.execute('select * from student')
results.fetchall()
db.close()

OperationalError: no such table: student

Adding data in table with csv(comma separated values) file directly

In [118]:
#Adding data in table with csv(comma separated values) file directly
import sqlite3
db=sqlite3.connect("C:/UsersAdmin/scores_database.db")

OperationalError: unable to open database file

In [119]:
#Declare cursor
cursor=db.cursor()

ProgrammingError: Cannot operate on a closed database.

In [85]:
#Create Table
cursor.execute("CREATE TABLE scores(gender TEXT, student_id INT PRIMARY KEY, marks INT)")

In [86]:
#Insert records into the table, (single record inserting)
cursor.execute("INSERT INTO scores(gender,student_id,marks) values('Male',100,55)")

In [87]:
#save the records permanently. (If you don’t commit, next time you will not see the records in the table)
db.commit()

In [88]:
#count of records inserted
print(cursor.rowcount,"Record(s)inserted")

1 Record(s)inserted

Inserting records from csv file

In [89]:
#Inserting records from csv file
with open('Scores_file.csv','r') as file:
    total_records=0
    for row in file:
        cursor.execute("insert into scores values(?,?,?)", row.split(","))
        db.commit()
        total_records+=1
print(total_records,'Records inserted')

FileNotFoundError: [Errno 2] No such file or directory: 'Scores_file.csv'

In [90]:
result = cursor.execute("SELECT * FROM scores")
for row in result:
    print(row)

('Male', 100, 55)

In [91]:
sql = "SELECT * FROM scores WHERE student_id = 104"
result = cursor.execute(sql)
for row in results:
    print(row)

In [92]:
#How to change the order of records (Increasing or decreasing)
result = cursor.execute("SELECT * FROM scores ORDER BY marks desc")
for row in results:
    print(row)

In [93]:
#single record update
sql="UPDATE scores SET marks = 50 WHERE student_id = 107"
cursor.execute(sql)

In [94]:
#Verify if its updated
result = cursor.execute("SELECT * FROM scores ORDER BY student_id")
for row in results:
    print(row)

In [95]:
#MIN
result = cursor.execute("SELECT MIN(marks) FROM scores")
print('Minimum Marks = ', result.fetchone())

Minimum Marks =  (55,)

In [96]:
#MAX
result = cursor.execute("SELECT MAX(marks) FROM scores")
print('Maximum Marks = ', result.fetchone())

Maximum Marks =  (55,)

In [97]:
db.close()

In [98]:
#Practice 
import sqlite3

In [99]:
db=sqlite3.connect("C:/Users/Admin/employee_database1.db")

In [100]:
cur=db.cursor()

In [101]:
cur.execute("create table employee (id int, name text, age int, address text, salary int)")

OperationalError: table employee already exists

In [102]:
cur.execute("insert into employee values(1, 'Ajeet', 27, 'Delhi', 20000)")

In [103]:
print(cur.rowcount, "Record(s) inserted")

1 Record(s) inserted

In [104]:
results=cur.execute("select * from employee")
for i in results:
    print(i)

(1, 'Ajeet', 35, 'Delhi', 20000)
(2, 'Allen', 35, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)
(1, 'Ajeet', 27, 'Delhi', 20000)

In [105]:
cur.execute("insert into employee values(2, 'Allen', 22, 'London', 25000),(3, 'Mark', 29, 'CA', 20000), (4, 'Kanchan', 22, 'Ghaziabad', 65000)")

In [106]:
print(cur.rowcount, "Record(s) inserted")

3 Record(s) inserted

In [107]:
results=cur.execute("select * from employee")
for i in results:
    print(i)

(1, 'Ajeet', 35, 'Delhi', 20000)
(2, 'Allen', 35, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)
(1, 'Ajeet', 27, 'Delhi', 20000)
(2, 'Allen', 22, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 22, 'Ghaziabad', 65000)

In [108]:
results=cur.execute('select id, name from employee')
for i in results:
    print(i)

(1, 'Ajeet')
(2, 'Allen')
(3, 'Mark')
(4, 'Kanchan')
(1, 'Ajeet')
(2, 'Allen')
(3, 'Mark')
(4, 'Kanchan')

In [109]:
results=cur.execute('select id, address from employee')
for i in results:
    print(i)

(1, 'Delhi')
(2, 'London')
(3, 'CA')
(4, 'Ghaziabad')
(1, 'Delhi')
(2, 'London')
(3, 'CA')
(4, 'Ghaziabad')

In [110]:
results=cur.execute('select * from employee')
for i in results:
    print(i)

(1, 'Ajeet', 35, 'Delhi', 20000)
(2, 'Allen', 35, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)
(1, 'Ajeet', 27, 'Delhi', 20000)
(2, 'Allen', 22, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 22, 'Ghaziabad', 65000)

In [111]:
#update any records
sql="update employee set age=25 where id=4"
cur.execute(sql)
db.commit()

In [112]:
results=cur.execute('select * from employee')
for i in results:
    print(i)

(1, 'Ajeet', 35, 'Delhi', 20000)
(2, 'Allen', 35, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)
(1, 'Ajeet', 27, 'Delhi', 20000)
(2, 'Allen', 22, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)

In [113]:
#update any records
sql="update employee SET age = 35 WHERE id IN (1,2)"
cur.execute(sql)
db.commit()

In [114]:
results=cur.execute('select * from employee')
for i in results:
    print(i)

(1, 'Ajeet', 35, 'Delhi', 20000)
(2, 'Allen', 35, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)
(1, 'Ajeet', 35, 'Delhi', 20000)
(2, 'Allen', 35, 'London', 25000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)

In [115]:
#Delete any unwanted records
sql="delete from employee where id=2"
cur.execute(sql)

In [116]:
results=cur.execute('select * from employee')
for i in results:
    print(i)

(1, 'Ajeet', 35, 'Delhi', 20000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)
(1, 'Ajeet', 35, 'Delhi', 20000)
(3, 'Mark', 29, 'CA', 20000)
(4, 'Kanchan', 25, 'Ghaziabad', 65000)

In [117]:
db.close()